app/views/games/_charlist.html.erb

Artifacts:
<% if character.artifacts.empty? %> None <%end%>
<%- character.artifacts.each do |art| %>
---
SELECT "artifacts".* FROM "artifacts" INNER JOIN "inventories" ON "artifacts"."id" = "inventories"."artifact_id" WHERE "inventories"."character_id" = ?  [["character_id", 35]]
SELECT 1 AS one FROM "artifacts" INNER JOIN "inventories" ON "artifacts"."id" = "inventories"."artifact_id" WHERE "inventories"."character_id" = ? LIMIT ?  [["character_id", 35], ["LIMIT", 1]]