app/controllers/games_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "characters".* FROM "characters" WHERE "characters"."user_id" = ?  [["user_id", 1]]
---
    def play
        if session[:user_id].nil?
            redirect_to '/'
            return
        end
        if User.find(session[:user_id]).in_progress == 1
            redirect_to '/start'
        else
            @characters = Character.where(user_id: session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "characters".* FROM "characters" WHERE "characters"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "characters" WHERE "characters"."user_id" = ?  [["user_id", 2]]
UPDATE "users" SET "in_progress" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["in_progress", 0], ["updated_at", "2024-09-20 15:51:11.322004"], ["id", 2]]
UPDATE "users" SET "in_progress" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["in_progress", 1], ["updated_at", "2024-09-20 15:51:07.625761"], ["id", 2]]
---
    def start
        if session[:user_id].nil?
            redirect_to '/'
            return
        end
        @user = User.find(session[:user_id])
        @characters = Character.where(user_id: session[:user_id])


        if @characters.count < 2
            redirect_to '/win'
            @user.in_progress = 0
            @user.save
        else
            @fighters = @characters.sample(2)
            @user.in_progress = 1
            @user.save

DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 63]]
---
    def absorb(fighter1, fighter2)
        fighter1.exp = fighter1.exp * 2
        fighter1.gold = fighter1.gold + fighter2.gold
        if fighter1.status < 3
            fighter1.status = fighter1.status + 1
        end
        fighter1.save
        Character.destroy(fighter2.id)

SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 64], ["LIMIT", 1]]
SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 63], ["LIMIT", 1]]
---
    def next
        @fighter1 = Character.find(params[:fighter1])
        @fighter2 = Character.find(params[:fighter2])

SELECT "characters".* FROM "characters" WHERE "characters"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 64]]
---
    def win
        @winner = Character.find_by(user_id: session[:user_id])

        if @winner.nil?
            redirect_to '/'
        else
            Character.destroy(@winner.id)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 1]]
SELECT "characters".* FROM "characters" WHERE "characters"."user_id" = ?  [["user_id", 1]]
---
    def restart
        if session[:user_id].nil?
            redirect_to '/'
            return
        end
        if !User.find(session[:user_id])
            redirect_to '/'
        else
            Character.where(user_id: session[:user_id]).destroy_all

SELECT "artifacts".* FROM "artifacts"
---
    def artifact_info
        @artifacts = Artifact.all