app/controllers/games_controller.rb

    def absorb(fighter1, fighter2)
        fighter1.exp = fighter1.exp * 2
        fighter1.gold = fighter1.gold + fighter2.gold
        if fighter1.status < 3
            fighter1.status = fighter1.status + 1
        end
        fighter1.winstreak = fighter1.winstreak + 1
        fighter1.save
        Character.destroy(fighter2.id)
---
DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 31]]

    def next
        @fighter1 = Character.find(session[:fighter1])
        @fighter2 = Character.find(session[:fighter2])
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 46], ["LIMIT", 1]]