app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "in_progress", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["username", "admin"], ["password_digest", "[FILTERED]"], ["in_progress", nil], ["created_at", "2024-09-20 13:17:53.816165"], ["updated_at", "2024-09-20 13:17:53.816165"]]
---
    def create
        @user = User.new(user_params)
        if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        if session[:user_id].to_s == params[:id]
            @user = User.find(params[:id])